In [3]:
import pandas as pd 

#load data 
df=pd.read_csv("top_youtube.csv")

In [4]:
df.head()

,Rank,Channel Name,Subscribers,Category,Views
0,1,MrBeast\n71%\n@mrbeast,409M\n0.7%,Entertainment,109.84M\n14.8%
1,2,T-Series\n32%\n@tseries,297M\n0.3%,Music,731.63K\n38.7%
2,3,Cocomelon - Nursery Rhymes\n70%\n@cocomelon,194M\n-,Education\nEntertainment,3.63M\n14.1%
3,4\n-,SET India\n@setindia,184M\n-,Entertainment,18.28K\n19.8%
4,5\n-,Vlad and Niki\n33%\n@vladandniki,142M\n0.7%,Entertainment,1.85M\n7.5%

In [5]:
df.shape

(100, 5)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          100 non-null    object
 1   Channel Name  100 non-null    object
 2   Subscribers   100 non-null    object
 3   Category      100 non-null    object
 4   Views         100 non-null    object
dtypes: object(5)
memory usage: 4.0+ KB

In [7]:
df = df.applymap(lambda x: x.split('\n')[0] if isinstance(x, str) else x)

C:\Users\Admin\AppData\Local\Temp\ipykernel_15064\2343252404.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df = df.applymap(lambda x: x.split('\n')[0] if isinstance(x, str) else x)

In [8]:
df

   Rank                 Channel Name Subscribers          Category    Views
0     1                      MrBeast        409M     Entertainment  109.84M
1     2                     T-Series        297M             Music  731.63K
2     3   Cocomelon - Nursery Rhymes        194M         Education    3.63M
3     4                    SET India        184M     Entertainment   18.28K
4     5                Vlad and Niki        142M     Entertainment    1.85M
..  ...                          ...         ...               ...      ...
95   96                 PowerKids TV       47.5M  Film & Animation   139.6K
96   97                  Felipe Neto       47.3M     Entertainment  240.92K
97   98                Speed Records       47.1M             Music  208.62K
98   99                  Alan Walker         47M             Music   229.3K
99  100  Goldmines Gaane Sune Ansune         47M             Music   42.71K

[100 rows x 5 columns]

In [9]:
def convert_to_million(val):
    if isinstance(val, str):
        val = val.strip().upper()
        if val.endswith('M'):
            return float(val[:-1])
        elif val.endswith('K'):
            return float(val[:-1]) / 1000
        elif val.endswith('B'):
            return float(val[:-1]) * 1000
        else:
            try:
                return float(val)
            except:
                return None
    return None

In [12]:
df['Views'] = df['Views'].apply(convert_to_million)
df['Subscribers'] = df['Subscribers'].apply(convert_to_million)

In [14]:
df.head()

  Rank                Channel Name  Subscribers       Category      Views
0    1                     MrBeast        409.0  Entertainment  109.84000
1    2                    T-Series        297.0          Music    0.73163
2    3  Cocomelon - Nursery Rhymes        194.0      Education    3.63000
3    4                   SET India        184.0  Entertainment    0.01828
4    5               Vlad and Niki        142.0  Entertainment    1.85000

In [16]:
df.to_csv("Top_100_youtube.csv", index=False)